import PageTitle from "src/presentation/components/common/page-title/PageTitle";
import { Typography } from "@mui/material";
import { useParams } from "react-router-dom";
import { Video } from "./VideoDetails.styles";

const videoData: Record<
  string,
  { title: string; videoUrl: string; description: string }
> = {
  "1": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 1",
    videoUrl: "/assets/videos/test2.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
  "2": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 2",
    videoUrl: "/assets/videos/test1.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
  "3": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 3",
    videoUrl: "/assets/videos/test1.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
  "4": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 4",
    videoUrl: "/assets/videos/test2.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
  "5": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 5",
    videoUrl: "/assets/videos/test1.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
  "6": {
    title: "آموزش قسمت های مختلف داشبورد مدیریت 6",
    videoUrl: "/assets/videos/test2.mp4",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،  ",
  },
};

function VideoDetails() {
  const { id } = useParams<{ id: string }>();
  const video = videoData[id ?? ""];

  if (!video) return <Typography>ویدیو پیدا نشد</Typography>;

  return (
    <>
      <PageTitle title={video.title} />

      <Video controls>
        <source src={video.videoUrl} type="video/mp4" />
      </Video>
      <Typography variant="body1" color="neutral.200">
        {video.description}
      </Typography>
    </>
  );
}

export default VideoDetails;
